//---------------------------------------------------------------------------
//!	@file	SystemMain.h
//! @brief	システムメイン
//---------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------
//!	@name	システム関数
//--------------------------------------------------------------
//@{

//	初期化
void SystemInit();

//	更新
void SystemUpdate();

//	描画
void SystemDraw();

//	終了
void SystemExit();

//	フレームの開始
void SystemBeginFrame();

//	フレームの終了
void SystemEndFrame();

//@}
//--------------------------------------------------------------
//!	@name	設定/参照
//--------------------------------------------------------------
//@{

//	パフォーマンスカウンターを取得 (単位:μsec)
u64 GetPerformanceCounterMicroSec();

//	経過時間計測をリセット
void ResetDeltaTime();

//	グリッドの表示をON/OFFします
//! @param  [in]    active  true:表示する false:非表示
void ShowGrid(bool active);

bool IsShowMenu();

//@}
